In [30]:
import pandas as pd

df_orders = pd.read_csv('01  Handling Duplicate Data_orders.csv')

In [31]:
df_orders

   OrderID  CustomerID   OrderDate  Amount
0        1        1001  2023-01-01     150
1        2        1002  2023-01-02     200
2        3        1003  2023-01-03     250
3        4        1004  2023-01-04     300
4        5        1001  2023-01-01     150
5        6        1002  2023-01-02     200
6        7        1003  2023-01-03     250
7        8        1005  2023-01-05     350
8        9        1006  2023-01-06     400
9       10        1007  2023-01-07     450

In [4]:
df_orders.shape

(10, 4)

In [32]:
print(df_orders.duplicated().sum())

0

In [33]:
df_orders

   OrderID  CustomerID   OrderDate  Amount
0        1        1001  2023-01-01     150
1        2        1002  2023-01-02     200
2        3        1003  2023-01-03     250
3        4        1004  2023-01-04     300
4        5        1001  2023-01-01     150
5        6        1002  2023-01-02     200
6        7        1003  2023-01-03     250
7        8        1005  2023-01-05     350
8        9        1006  2023-01-06     400
9       10        1007  2023-01-07     450

In [34]:
df_orders.duplicated(subset=['CustomerID', 'OrderDate', 'Amount'])

0    False
1    False
2    False
3    False
4     True
5     True
6     True
7    False
8    False
9    False
dtype: bool

In [35]:
df_orders.duplicated(subset=['CustomerID', 'OrderDate', 'Amount']).sum()

3

In [36]:
df_orders.shape

(10, 4)

In [38]:
# remove duplicates
df_orders.drop_duplicates(subset=['CustomerID', 'OrderDate', 'Amount'], inplace=True, keep='first')

In [44]:
df_orders.duplicated(subset=['CustomerID', 'OrderDate', 'Amount']).sum()

0

In [45]:
df_orders

   OrderID  CustomerID   OrderDate  Amount
0        1        1001  2023-01-01     150
1        2        1002  2023-01-02     200
2        3        1003  2023-01-03     250
3        4        1004  2023-01-04     300
7        8        1005  2023-01-05     350
8        9        1006  2023-01-06     400
9       10        1007  2023-01-07     450